Revit 2027 API
CurveByPointsUtils.GetFaceRegions Method
 Gets the FaceRegions in the existing face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Reference> GetFaceRegions(
	Document cda,
	Reference referenceOfFace
)
Public Shared Function GetFaceRegions (
	cda As Document,
	referenceOfFace As Reference
) As IList(Of Reference)
public:
static IList<Reference^>^ GetFaceRegions(
	Document^ cda,
	Reference^ referenceOfFace
)
static member GetFaceRegions :
        cda : Document *
        referenceOfFace : Reference -> IList<Reference>
Parameters
cda Document
 The Document.
referenceOfFace Reference
 The Reference of the existing face.
Return Value
IList<Reference>
 The FaceRegions in the existing face, or an empty collection if no FaceRegions are found.
Exceptions
Exception | Condition
ArgumentException |  The Reference is not a Face Reference.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace